Documents/Тестирование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Document>
		<Properties>
			<Name>Тестирование</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.РезультатыТестирования</xr:Item>
				<xr:Item>AccumulationRegister.ОтветыПриТестировании</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Учащийся</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тест</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Тесты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оценка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Оценки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗатраченоВремени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Вопросы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вопрос</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Вопросы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыОтветов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Ответы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ответ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыОтветов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вопрос</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Вопросы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Тестирование/Forms/ФормаДокумента/Ext/Form/Module.bsl
Процедура ВопросыЗаполнить()
	Объект.Вопросы.Загрузить(Тесты.ВопросыЗаполнить(Объект.Тест));
	Элементы.ХодВыполнения.МаксимальноеЗначение = Объект.Вопросы.Количество();
	
	Таймер	= Объект.Тест.ПродолжительностьТестирования * 60;
КонецПроцедуры

Функция ВопросСледующий()
	ВопросСледующий = Неопределено;
	Для Каждого ТекСтрока Из Объект.Вопросы Цикл
		Если НЕ ЗначениеЗаполнено(ТекСтрока.Ответ) Тогда
			ВопросСледующий = ТекСтрока.Вопрос;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат ВопросСледующий;
КонецФункции

Процедура Отвечаю(НомерОтвета)
	ВариантОтвета = ВариантыОтветов.Получить(НомерОтвета - 1);
	Если ВариантОтвета <> Неопределено Тогда
		Для Каждого ТекСтрока Из Объект.Вопросы Цикл
			Если ТекСтрока.Вопрос = ТекущийВопрос Тогда
				ТекСтрока.Ответ		= ВариантОтвета.Значение;
				ТекСтрока.Результат	= ВариантОтвета.Значение.Вес;
				
				ХодВыполнения		= ХодВыполнения + 1;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	ВопросЗадать();
КонецПроцедуры

Процедура Оценить()
	Объект.ЗатраченоВремени	= Окр(?(ОбратныйОтсчетВремени, Элементы.Таймер.МаксимальноеЗначение - Таймер, Таймер) / 60);
	Если Объект.Тест.ОцениватьРезультат Тогда
		Результат		= Объект.Вопросы.Итог("Результат");
		Объект.Оценка	= Тесты.Оценить(Объект.Тест, Результат);
	Иначе
		Элементы.Оценка.Видимость				= Ложь;
		Элементы.ОценкаКомментарий.Видимость	= Ложь;
	КонецЕсли;
КонецПроцедуры

Процедура ВопросЗадать()
	Если Шаг = 1 Тогда
		ТекущийВопрос	= ВопросСледующий();
		Если НЕ ЗначениеЗаполнено(ТекущийВопрос) Тогда
			Шаг = 9;
		КонецЕсли;
	КонецЕсли;
	Если Шаг = 1 Тогда
		ВопросТекст		= ТекущийВопрос.Наименование;
		
		мОтветы = Новый Массив;
		мОтветы.Добавить(Элементы.Ответ1);
		мОтветы.Добавить(Элементы.Ответ2);
		мОтветы.Добавить(Элементы.Ответ3);
		мОтветы.Добавить(Элементы.Ответ4);
		мОтветы.Добавить(Элементы.Ответ5);
		мОтветы.Добавить(Элементы.Ответ6);
		Для Каждого текЭлемент Из мОтветы Цикл
			текЭлемент.Видимость	= Ложь;
			текЭлемент.Заголовок	= "";
		КонецЦикла;
		ОтветыВыборка = Тесты.ОтветыПоВопросу(ТекущийВопрос);
		ВариантыОтветов.Очистить();
		НомерСтроки = 0;
		Для Каждого тСтрока Из ОтветыВыборка Цикл
			мОтветы[НомерСтроки].Видимость	= Истина;
			мОтветы[НомерСтроки].Заголовок	= тСтрока.Наименование;
			ВариантыОтветов.Добавить(тСтрока.Ссылка);
			
			НомерСтроки = НомерСтроки + 1;
		КонецЦикла;
	Иначе
		Если Модифицированность И Объект.Вопросы.Количество() > 0 Тогда
			Объект.ЗатраченоВремени	= Окр(Таймер / 60);
			Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
		КонецЕсли;
		
		Оценить();
		
		ЭкранОбновить();
	КонецЕсли;
КонецПроцедуры

Процедура ЭкранОбновить()
	Элементы.Шаг0.Видимость	= (Шаг = 0);
	Элементы.Шаг1.Видимость	= (Шаг = 1);
	Элементы.Шаг9.Видимость	= (Шаг > 6);
КонецПроцедуры

&НаКлиенте
Процедура КаунтДаун()
	Таймер = ?(ОбратныйОтсчетВремени, Элементы.Таймер.МаксимальноеЗначение - (ТекущаяДата() - ВремяСтарта), ТекущаяДата() - ВремяСтарта);
	Если ?(ОбратныйОтсчетВремени, Таймер <= 0, Таймер >= Элементы.Таймер.МаксимальноеЗначение) Тогда
		ОтключитьОбработчикОжидания("КаунтДаун");
		
		Элементы.ВремяИстекло.Видимость	= Истина;
		Шаг	= 8;
		ВопросЗадать();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Начать(Команда)
	Если Объект.Тест.Пустая() Тогда
		Сообщить("Выберите тест");
	ИначеЕсли Объект.Учащийся.Пустая() Тогда
		Сообщить("Не указан учащийся");
	Иначе
		Заголовок = Объект.Тест;
		ВопросыЗаполнить();
		
		Шаг = 1;
		ЭкранОбновить();
		ВопросЗадать();
		Если Таймер > 0 Тогда
			Элементы.ЗатраченоВремени.Видимость		= Истина;
			Элементы.Таймер.Видимость				= Истина;
			Элементы.Таймер.МаксимальноеЗначение	= Таймер;
			ПодключитьОбработчикОжидания("КаунтДаун", Тесты.ИнтервалПолучить(Элементы.Таймер.МаксимальноеЗначение));
			Если НЕ ОбратныйОтсчетВремени Тогда
				Таймер									= 0;
			КонецЕсли;
		КонецЕсли;
		ВремяСтарта	= ТекущаяДата();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТестПриИзменении(Элемент)
	Если НЕ Тесты.ТестДоступен(Объект.Тест) Тогда
		Сообщить("Данный тест не доступен." + Строка(Объект.Тест));
		Объект.Тест = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УчащийсяОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура Ответ1(Команда)
	Отвечаю(1);
КонецПроцедуры

&НаКлиенте
Процедура Ответ2(Команда)
	Отвечаю(2);
КонецПроцедуры

&НаКлиенте
Процедура Ответ3(Команда)
	Отвечаю(3);
КонецПроцедуры

&НаКлиенте
Процедура Ответ4(Команда)
	Отвечаю(4);
КонецПроцедуры

&НаКлиенте
Процедура Ответ5(Команда)
	Отвечаю(5);
КонецПроцедуры

&НаКлиенте
Процедура Ответ6(Команда)
	Отвечаю(6);
КонецПроцедуры

&НаКлиенте
Процедура ПредыдущийВопрос(Команда)
	ф=1;
КонецПроцедуры

&НаКлиенте
Процедура СледующийВопрос(Команда)
	ф=1;
КонецПроцедуры

&НаКлиенте
Процедура ОценкаОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ОценкаКомментарийОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ Объект.Ссылка.Пустая() Тогда

	ИначеЕсли Объект.Учащийся.Пустая() Тогда
		Если Юзеры.ТекущийПользователь().ФизЛицо.Пустая() Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Ошибка создания", Отказ);
		Иначе
			Объект.Учащийся = Юзеры.ТекущийПользователь().ФизЛицо;
		КонецЕсли;
	ИначеЕсли НЕ Объект.Ссылка.Пустая() Тогда
		Если Объект.Вопросы.Количество() > 0 Тогда
			Шаг = ?(ЗначениеЗаполнено(ВопросСледующий()), 1, 9);
			ВопросЗадать();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Объект.Ссылка.Пустая() Тогда
		ВремяИстекло	= "Время теста истекло";
		ЭкранОбновить();
		ОбратныйОтсчетВремени	= Халк.ОбратныйОтсчетВремениПриТестировании();
	Иначе
		Отказ	= Истина;
		Форма	= ПолучитьФорму("Документ.Тестирование.Форма.ФормаДокумента1", Новый Структура("Ключ", Объект.Ссылка));
		Форма.Открыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	Если Шаг = 1 Тогда
		#Если ВебКлиент Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Тест не был завершен", Отказ);
			Шаг = 7;
			ВопросЗадать();
		#Иначе
			Если Вопрос("Вы действительно хотите прервать тестирование?", РежимДиалогаВопрос.ОКОтмена, 600, КодВозвратаДиалога.Отмена, , КодВозвратаДиалога.ОК) = КодВозвратаДиалога.Отмена Тогда
				Отказ = Истина;
			КонецЕсли;
		#КонецЕсли
	КонецЕсли;
КонецПроцедуры
